In [1]:
import numpy as np
import pandas as pd

data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
"year": [2000, 2001, 2002, 2001, 2002, 2003],
"pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}
frame = pd.DataFrame(data)

In [2]:
data

{'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [3]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [4]:
frame2 = pd.DataFrame(data, columns=["year", "state", "pop", "debt"])

In [5]:
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [6]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [7]:
frame2.loc[1]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: 1, dtype: object

In [8]:
frame2.iloc[2]

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [9]:
frame2["debt"]  = 16.5

In [10]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5  16.5
1  2001    Ohio  1.7  16.5
2  2002    Ohio  3.6  16.5
3  2001  Nevada  2.4  16.5
4  2002  Nevada  2.9  16.5
5  2003  Nevada  3.2  16.5

In [11]:
frame2["debt"] = np.arange(6.)

In [12]:
frame2

   year   state  pop  debt
0  2000    Ohio  1.5   0.0
1  2001    Ohio  1.7   1.0
2  2002    Ohio  3.6   2.0
3  2001  Nevada  2.4   3.0
4  2002  Nevada  2.9   4.0
5  2003  Nevada  3.2   5.0

In [13]:
frame2['eastern'] = frame2.state == 'Ohio'

In [14]:
frame2

   year   state  pop  debt  eastern
0  2000    Ohio  1.5   0.0     True
1  2001    Ohio  1.7   1.0     True
2  2002    Ohio  3.6   2.0     True
3  2001  Nevada  2.4   3.0    False
4  2002  Nevada  2.9   4.0    False
5  2003  Nevada  3.2   5.0    False

In [15]:
a, b = 0, 1
while b < 2000000:
    print(b, end = ' ')
    a, b = b, a + b

1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269

In [16]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

In [17]:
frame3 = pd. DataFrame(populations)

In [18]:
frame3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [19]:
frame3.T

        2000  2001  2002
Ohio     1.5   1.7   3.6
Nevada   NaN   2.4   2.9

In [20]:
a, b = 0, 1
while b < 2000000:
    print(b, end = ' ')
    a, b = b, a + b

1 1 2 3 5 8 13 21 34 55 89 144 233 377 610 987 1597 2584 4181 6765 10946 17711 28657 46368 75025 121393 196418 317811 514229 832040 1346269

In [21]:
populations = {"Ohio": {2000: 1.5, 2001: 1.7, 2002: 3.6}, "Nevada": {2001: 2.4, 2002: 2.9}}

In [22]:
pd.DataFrame(populations, index=[2001, 2002, 2003])

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9
2003   NaN     NaN

In [23]:
frame3.index.name = "year"; frame3.columns.name = "state"

In [24]:
frame3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [25]:
frame3.to_numpy()

array([[1.5, nan],
       [1.7, 2.4],
       [3.6, 2.9]])

In [26]:
frame3.columns

Index(['Ohio', 'Nevada'], dtype='object', name='state')

In [27]:
"Ohio" in frame3.columns

True

In [28]:
frame3.index

Index([2000, 2001, 2002], dtype='int64', name='year')

In [29]:
obj = pd.Series(range(3), index=["a", "b", "c"])

In [30]:
obj

a    0
b    1
c    2
dtype: int64

In [31]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=["d", "b", "a", "c"])

In [32]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [33]:
obj2 = obj.reindex(["a", "b", "c", "d", "e"])

In [34]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [35]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=[0, 1, 2, 3])

In [36]:
obj

0    4.5
1    7.2
2   -5.3
3    3.6
dtype: float64

In [37]:
obj.T

0    4.5
1    7.2
2   -5.3
3    3.6
dtype: float64

In [38]:
obj.abs()

0    4.5
1    7.2
2    5.3
3    3.6
dtype: float64

In [39]:
obj.sort_values()

2   -5.3
3    3.6
0    4.5
1    7.2
dtype: float64

In [40]:
obj = pd.Series(np.arange(5), index=["a", "a", "b", "b", "c"])

In [41]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [42]:
obj.index.is_unique

False

In [43]:
obj["a"]

a    0
a    1
dtype: int64

In [44]:
df = pd.DataFrame(np.random.randn(4, 3), index=["a", "a", "b", "b"])

In [45]:
df

          0         1         2
a -0.537565 -0.051074  0.271194
a -0.841991  0.841386  0.592956
b -0.310554 -1.906582 -1.108970
b -0.697821 -0.090915  0.272513

In [46]:
df.loc["b"]

          0         1         2
b -0.310554 -1.906582 -1.108970
b -0.697821 -0.090915  0.272513

In [47]:
df.loc["a"]

          0         1         2
a -0.537565 -0.051074  0.271194
a -0.841991  0.841386  0.592956

In [48]:
df = pd.DataFrame(np.random.standard_normal((5, 3)), index=["a", "a", "b", "b", "c"])

In [49]:
df

          0         1         2
a  0.296462 -0.548726  1.446463
a -0.301667 -0.844234 -0.471903
b -0.784896  0.685070  0.140668
b  0.279421  0.758038  1.705043
c  0.408123 -2.319336 -0.196405

In [50]:
df.loc["b"]

          0         1         2
b -0.784896  0.685070  0.140668
b  0.279421  0.758038  1.705043

In [51]:
df.loc["c"]

0    0.408123
1   -2.319336
2   -0.196405
Name: c, dtype: float64

In [52]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5], [np.nan, np.nan], [0.75, -1.3]], index=["a", "b", "c", "d"], columns=["one", "two"])

In [53]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [54]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [55]:
df.sum(axis="columns")

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [56]:
df.sum(axis="rows")

one    9.25
two   -5.80
dtype: float64

In [57]:
df.sum(axis="index")

one    9.25
two   -5.80
dtype: float64

In [58]:
data  = pd.DataFrame({"Ohio": [0, 0, 0, 0], "Colorado": [0, 5, 6, 7], "Utah": [8, 9, 10, 11], "New York": [12, 13, 14, 15]})

In [59]:
data

   Ohio  Colorado  Utah  New York
0     0         0     8        12
1     0         5     9        13
2     0         6    10        14
3     0         7    11        15

In [60]:
data1 = data.T

In [61]:
data1

           0   1   2   3
Ohio       0   0   0   0
Colorado   0   5   6   7
Utah       8   9  10  11
New York  12  13  14  15

In [62]:
data1.columns = ["one", "two", "three", "four"]

In [63]:
data1

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [64]:
data1.loc["Colorado"]

one      0
two      5
three    6
four     7
Name: Colorado, dtype: int64

In [65]:
data1.loc[["Colorado", "New York"]]

          one  two  three  four
Colorado    0    5      6     7
New York   12   13     14    15

In [66]:
data1

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [67]:
data1.iloc[[2, 1]]

          one  two  three  four
Utah        8    9     10    11
Colorado    0    5      6     7

In [68]:
data1

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [69]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=["a", "c", "d", "e"])

In [70]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [71]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=["a", "c", "e", "f", "g"])

In [72]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [73]:
s1 + s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [74]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list("bcd"), index=["Ohio", "Texas", "Colorado"])

In [75]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])

In [76]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [77]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [78]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [79]:
frame = pd.DataFrame(np.random.standard_normal((4,3)), columns=list("bde"), index=["Utah", "Ohio", "Texas", "Oregon"])

In [80]:
frame

               b         d         e
Utah   -1.965559  2.272715  0.130666
Ohio   -1.528874  0.099180  0.157388
Texas  -1.238481  0.860319 -2.160309
Oregon  0.162132  0.480819  0.863263

In [81]:
np.abs(frame)

               b         d         e
Utah    1.965559  2.272715  0.130666
Ohio    1.528874  0.099180  0.157388
Texas   1.238481  0.860319  2.160309
Oregon  0.162132  0.480819  0.863263

In [82]:
def f1(x):
    return x.max() - x.min()

In [83]:
frame.apply(f1)

b    2.127691
d    2.173535
e    3.023572
dtype: float64

In [84]:
def f2(x):
    return pd.Series([x.min(), x.max()], index=["min", "max"])

In [85]:
frame.apply(f2)

            b         d         e
min -1.965559  0.099180 -2.160309
max  0.162132  2.272715  0.863263